DataProcessors/НачислениеПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>НачислениеПени</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПениШтрафы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗадолженности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пеня</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтОплаты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДействиеПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДействиеПени</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/КорректировкаНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>КорректировкаНачислений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоРегиональнымСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.РасшифровкаНачисленияЛьгот</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодКорректировки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Льготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льготчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/НачислениеПени/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
		 Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не заполнено Здание!'; uk = 'Не заповнена Будівля!'");
		Сообщение.Поле = "Объект.Здание";
		//Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли  НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		  Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не заполнена Организация!'; uk = 'Не заповнена Організація!'");
		Сообщение.Поле = "Объект.Организация";
		//Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли  НЕ ЗначениеЗаполнено(Объект.ПроцентПени) Тогда
		  Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не указан процент пени!'; uk = 'Не вказаний відсоток пені!'");
		Сообщение.Поле = "Объект.ПроцентПени";
		//Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;
	
	Текст =  НСтр("ru = 'Таблица будет очищена. Продолжить?'; uk = 'Таблиця буде очищена. Продовжити?'");
	
	Если Объект.Таблица.Количество() > 0 Тогда
		Ответ = Вопрос(Текст,РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Таблица.Очистить();
			ЗаполнитьНаСервере();
		КонецЕсли;
	Иначе
		ЗаполнитьНаСервере();
	КонецЕсли;
	
	
	
КонецПроцедуры


&НаСервере
Функция  ПолучитьНеДействующие(ЛицевойСчет,ДатаНачала,ДатаОкончания)
	
	ТАбДат = Новый ТаблицаЗначений;
	ТАбДат.Колонки.Добавить("ДатаНач",Новый ОписаниеТипов("Дата"));
	ТАбДат.Колонки.Добавить("ДатаКон",Новый ОписаниеТипов("Дата"));
	ТАбДат.Колонки.Добавить("Действует",Новый ОписаниеТипов("Булево"));
	ТАбДат.Колонки.Добавить("КолДней", Новый ОписаниеТипов("Число")); 
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ДатаСрезНачало КАК Период,
		|	ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
		|	ЕСТЬNULL(ДействиеПениСрезПоследних.Действует, ИСТИНА) КАК Действует
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействиеПени.СрезПоследних(&ДатаСрезНачало, ЛицевойСчет = &ЛицевойСчет) КАК ДействиеПениСрезПоследних
		|		ПО (ДействиеПениСрезПоследних.ЛицевойСчет = ЛицевыеСчета.Ссылка)
		|ГДЕ
		|	ЛицевыеСчета.Ссылка = &ЛицевойСчет
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ДействиеПениСрезПоследних.Действует, ИСТИНА),
		|	ЛицевыеСчета.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСрезОкончание,
		|	ЛицевыеСчета.Ссылка,
		|	ЕСТЬNULL(ДействиеПениСрезПоследних.Действует, ИСТИНА)
		|ИЗ
		|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействиеПени.СрезПоследних(&ДатаСрезОкончание, ЛицевойСчет = &ЛицевойСчет) КАК ДействиеПениСрезПоследних
		|		ПО (ДействиеПениСрезПоследних.ЛицевойСчет = ЛицевыеСчета.Ссылка)
		|ГДЕ
		|	ЛицевыеСчета.Ссылка = &ЛицевойСчет
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицевыеСчета.Ссылка,
		|	ЕСТЬNULL(ДействиеПениСрезПоследних.Действует, ИСТИНА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДействиеПени.Период,
		|	ДействиеПени.ЛицевойСчет,
		|	ДействиеПени.Действует
		|ИЗ
		|	РегистрСведений.ДействиеПени КАК ДействиеПени
		|ГДЕ
		|	ДействиеПени.Период МЕЖДУ &ДатаСрезНачало И &ДатаСрезОкончание
		|	И ДействиеПени.ЛицевойСчет = &ЛицевойСчет
		|
		|СГРУППИРОВАТЬ ПО
		|	ДействиеПени.Период,
		|	ДействиеПени.Действует,
		|	ДействиеПени.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Период КАК Период,
		|	ВТ.ЛицевойСчет,
		|	ВТ.Действует
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.ЛицевойСчет,
		|	ВТ.Период,
		|	ВТ.Действует
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("ДатаСрезНачало", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаСрезОкончание", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Если ВыборкаДетальныеЗаписи.Количество() = 2 Тогда
	//	Возврат ЛОЖЬ;
	//КонецЕсли;	
	
	ДатаНач = "";
	ДатаКон = "";
	Действие = Неопределено;
	
	Первый = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Если ДатаНач = "" Тогда	
		//	ДатаНач = ВыборкаДетальныеЗаписи.Период;
		//	Действие = ВыборкаДетальныеЗаписи.Действует;
		//	Продолжить;
		//КонецЕсли;
		//
		//Если (ДатаНач <> "" И Действие<> ВыборкаДетальныеЗаписи.Действует) ИЛИ
		//	(ДатаНач <> ВыборкаДетальныеЗаписи.Период И Действие<> ВыборкаДетальныеЗаписи.Действует) Тогда
		//	ДатаКон = ВыборкаДетальныеЗаписи.Период;
		//	
		//	НоваяСтрока = ТАбДат.Добавить();
		//	НоваяСтрока.ДатаНач = ДатаНач;
		//	НоваяСтрока.ДатаКон = ДатаКон;
		//	НоваяСтрока.Действует = Действие;
		//	Действие = ВыборкаДетальныеЗаписи.Действует;
		//	ДатаНач = ДатаКон;
		//ИначеЕсли Действие =  ВыборкаДетальныеЗаписи.Действует Тогда
		//	ДатаКон = ВыборкаДетальныеЗаписи.Период;
		//    НоваяСтрока.ДатаКон = ДатаКон;
		//	ДатаНач = ДатаКон;
		//КонецЕсли;
		
		Если Первый Тогда
			Строка = ТАбДат.Добавить();
			Строка.ДатаНач = ВыборкаДетальныеЗаписи.Период;
			Строка.Действует = ВыборкаДетальныеЗаписи.Действует;
			Первый = Ложь;
		КонецЕсли;	
		
		Если НЕ Первый Тогда
			Если Строка.Действует <> ВыборкаДетальныеЗаписи.Действует Тогда
				Строка.ДатаКон = ВыборкаДетальныеЗаписи.Период;
				Строка = ТАбДат.Добавить();
				Строка.ДатаНач = ВыборкаДетальныеЗаписи.Период;
				Строка.Действует = ВыборкаДетальныеЗаписи.Действует;
			ИНаче
				Строка.ДатаКон = ВыборкаДетальныеЗаписи.Период;
			КонецЕсли;
			
		КонецЕсли;	
				
				
		
	КонецЦикла;
	
	Для каждого Строка Из ТАбДат Цикл
	
			Строка.КолДней = (НачалоДня(Строка.ДатаКон)-НачалоДня(Строка.ДатаНач))/86400;	
	
	КонецЦикла; 
	
	Возврат ТАбДат;

	


КонецФункции // ПолучитьНеДействующие()

&НаСервере
Процедура ЗаполнитьНаСервере()

	Запрос = Новый ЗАпрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления,
	               |	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОСтаток
	               |ПОМЕСТИТЬ ост
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	               |			&ТекущийМесяц,
	               |			Организация = &Организация
	               |				И ЛицевойСчет.Владелец = &Здание
	               |				И Услуга <> &Пеня
	               |				И МесяцНачисления <> &ПустаяДата
	               |				И МесяцНачисления <> НАЧАЛОПЕРИОДА(&ТекущийМесяц, МЕСЯЦ)) КАК РасчетыПоЛицевымСчетамОстатки
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.МесяцНачисления КАК МесяцНачисления,
	               |	СУММА(ЕСТЬNULL(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход, 0)) КАК СуммаРасход,
	               |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток) КАК Сумма,
	               |	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РасчетыПоЛицевымСчетамОстаткиИОбороты.МесяцНачисления, МЕСЯЦ), МЕСЯЦ, 1), МЕСЯЦ) КАК ПериодС,
	               |	КОНЕЦПЕРИОДА(РасчетыПоЛицевымСчетамОстаткиИОбороты.Период, ДЕНЬ) КАК ПериодПО,
	               |	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РасчетыПоЛицевымСчетамОстаткиИОбороты.МесяцНачисления, МЕСЯЦ), МЕСЯЦ, 1), КОНЕЦПЕРИОДА(РасчетыПоЛицевымСчетамОстаткиИОбороты.Период, ДЕНЬ), ДЕНЬ) КАК КолДней,
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Период КАК Период,
	               |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец,
	               |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаДоОплаты,
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Регистратор
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
	               |			&НачалоЗакона,
	               |			&Период,
	               |			Регистратор,
	               |			,
	               |			Организация = &Организация
	               |				И ЛицевойСчет.Владелец = &Здание
	               |				И Услуга <> &Пеня
	               |				И МесяцНачисления <> &ПустаяДата
	               |				И МесяцНачисления <> НАЧАЛОПЕРИОДА(&ТекущийМесяц, МЕСЯЦ)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	               |		ПО РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетамОстаткиИОбороты.Регистратор) <> ТИП(Документ.КорректировкаНачислений)
	               |				ТОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.Период > ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РасчетыПоЛицевымСчетамОстаткиИОбороты.МесяцНачисления, МЕСЯЦ), МЕСЯЦ, 1)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Период,
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.МесяцНачисления,
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	               |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
	               |	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РасчетыПоЛицевымСчетамОстаткиИОбороты.МесяцНачисления, МЕСЯЦ), МЕСЯЦ, 1), КОНЕЦПЕРИОДА(РасчетыПоЛицевымСчетамОстаткиИОбороты.Период, ДЕНЬ), ДЕНЬ),
	               |	КОНЕЦПЕРИОДА(РасчетыПоЛицевымСчетамОстаткиИОбороты.Период, ДЕНЬ),
	               |	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РасчетыПоЛицевымСчетамОстаткиИОбороты.МесяцНачисления, МЕСЯЦ), МЕСЯЦ, 1), МЕСЯЦ),
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ост.ЛицевойСчет КАК ЛицевойСчет,
	               |	НАЧАЛОПЕРИОДА(вт.МесяцНачисления, МЕСЯЦ) КАК МесяцНачисления,
	               |	ЕСТЬNULL(вт.СуммаРасход, 0) КАК СуммаРасход,
	               |	ЕСТЬNULL(вт.Сумма, 0) КАК Сумма,
	               |	вт.ПериодС КАК ПериодС,
	               |	вт.ПериодПО,
	               |	вт.КолДней,
	               |	вт.Период КАК Период,
	               |	вт.ОтветственныйВладелец КАК ОтветственныйВладелец,
	               |	ЕСТЬNULL(вт.СуммаДоОплаты, 0) КАК СуммаДоОплаты,
	               |	вт.Регистратор
	               |ИЗ
	               |	ост КАК ост
	               |		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
	               |		ПО ост.ЛицевойСчет = вт.ЛицевойСчет
	               |			И ост.МесяцНачисления = вт.МесяцНачисления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период,
	               |	ЛицевойСчет,
	               |	МесяцНачисления,
	               |	ПериодС
	               |ИТОГИ
	               |	СУММА(Сумма),
	               |	МАКСИМУМ(ОтветственныйВладелец)
	               |ПО
	               |	ЛицевойСчет,
	               |	МесяцНачисления";
	
		Запрос.УстановитьПараметр("Период",КонецДня(Объект.Период));
		Запрос.УстановитьПараметр("Здание",Объект.Здание);
		Запрос.УстановитьПараметр("Организация",Объект.Организация);
		Запрос.УстановитьПараметр("Пеня",Справочники.Услуги.ПениШтрафы);
		Запрос.УстановитьПараметр("ПустаяДата",Дата('00010101'));
		Запрос.УстановитьПараметр("ТекущийМесяц",КонецДня(Объект.ДатаДокументов));
		Запрос.УстановитьПараметр("НачалоЗакона",НачалоМесяца(Дата('20190501')));
		//
		//Запрос.УстановитьПараметр("ЛицевойСчет",Справочники.ЛицевыеСчета.НайтиПоНаименованию("261050"));
		
		ВыборкаЛС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЛС.Следующий() Цикл 
			Если ВыборкаЛС.Сумма <= 0
				И ВыборкаЛС.СуммаДооплаты <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
					
			Владелец = ВыборкаЛС.ОтветственныйВладелец;
			ВыборкаМесяцНачисления = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаМесяцНачисления.Следующий() Цикл
				
				Если ВыборкаМесяцНачисления.Сумма <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Выборка = ВыборкаМесяцНачисления.Выбрать();
				Период = "";
				ПризнакОплаты = Ложь;
				СтруктураПоиска = Новый Структура("ЛицевойСчет,МесяцНачисления");
				ПраметрыПоискаДействия = Новый Структура("ЛицевойСчет");
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.КолДней < 0 Тогда
						Продолжить;
					КонецЕсли;	
					
					ПраметрыПоискаДействия.Вставить("ЛицевойСчет",Выборка.ЛицевойСчет);
					
										
					Если Период <> "" Тогда
						ПериодС  = Период;
					Иначе	
						ПериодС  = Выборка.ПериодС;
					КонецЕсли;
					
					Если ПериодС < НачалоМесяца(Дата('20190501')) Тогда
						ПериодС  = НачалоМесяца(Дата('20190501'));
					КонецЕсли;	
					
					Если КонецДня(ПериодС) >= КонецДня(Объект.Период) Тогда
						Продолжить;
						КонецЕсли;
						НоваяСтрока = Объект.Таблица.Добавить();

						НоваяСтрока.ЛицевойСчет = Выборка.ЛицевойСчет;
						НоваяСтрока.ОтветственныйВладелец = Владелец;
						НоваяСтрока.ПериодПо = Выборка.ПериодПо;
						НоваяСтрока.ПериодС  = ПериодС;
						
						КолДней = (Началодня(НоваяСтрока.ПериодПо) - НачалоДня(НоваяСтрока.ПериодС))/86400;
						
						СуммаЗадолженности = Выборка.Сумма;
						
						
						Если КолДней = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						
						
						СуммаНачиленойПениВпериоде = ПолучитьСуммуНачисленойПени(НоваяСтрока.ПериодС,НоваяСтрока.ПериодПо,Выборка.ЛицевойСчет,Выборка.МесяцНачисления);
						НоваяСтрока.МесяцНачисления  = Выборка.МесяцНачисления;
						ЕстьПлатежьС = ПолучитьПлатежь(Выборка.ЛицевойСчет,НоваяСтрока.ПериодС,Выборка.МесяцНачисления);
						ЕстьПлатежьПО = ПолучитьПлатежь(Выборка.ЛицевойСчет,НоваяСтрока.ПериодПо,Выборка.МесяцНачисления);
						
						
						Если ЕстьПлатежьС Тогда
							КолДней = КолДней - 1;
						КонецЕсли;
						
						Если ЕстьПлатежьПО Тогда
							КолДней = КолДней - 1;
						КонецЕсли;
							
						НоваяСтрока.СуммаЗадолженности  = СуммаЗадолженности;
						//КолДней = (Началодня(НоваяСтрока.ПериодПо) - НачалоДня(НоваяСтрока.ПериодС))/86400;
						НоваяСтрока.КолДней = КолДней;
						Пеня = (СуммаЗадолженности*(Объект.ПроцентПени/100)* КолДней)-СуммаНачиленойПениВпериоде;
						НоваяСтрока.Пеня = Мин(СуммаЗадолженности,Пеня);
				
						Период = Выборка.Период;
					//КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;	
		
		ТАбЗН = Объект.Таблица.Выгрузить();

		ТаблицаЗаполнения = ТАбЗН.СкопироватьКолонки();
		Для каждого Строка Из ТАбЗН Цикл
			
			Если Строка.ЛицевойСчет = Справочники.ЛицевыеСчета.НайтиПоНаименованию("4049") Тогда
				а = 0;
			КонецЕсли;	

			
			НовыеСтроки  = ПолучитьНеДействующие(Строка.ЛицевойСчет,Строка.ПериодС,Строка.ПериодПо);
			Для каждого СтрокаТ Из НовыеСтроки Цикл
				
			    СтрокаТабЗаполнения = ТаблицаЗаполнения.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабЗаполнения,Строка);
				СтрокаТабЗаполнения.ПериодС = СтрокаТ.ДатаНач;
				
				СтрокаТабЗаполнения.ПериодПо = СтрокаТ.ДатаКон;
				
				Если НачалоДня(СтрокаТ.ДатаНач) = НачалоДня(Строка.ПериодС)
						и  НачалоДня(СтрокаТ.ДатаКон) = НачалоДня(Строка.ПериодПО) Тогда
						    СтрокаТ.КолДней = Строка.КолДней;
				КонецЕсли;			
				
				Если Строка.ОтОплаты Тогда
					КолДней =  СтрокаТ.КолДней-1;
				Иначе 
					КолДней = СтрокаТ.КолДней;
				КонецЕсли;
				
				СтрокаТабЗаполнения.КолДней = КолДней;
				Если СтрокаТ.Действует Тогда
					СтрокаТабЗаполнения.Пеня =(Строка.СуммаЗадолженности*Объект.ПроцентПени* КолДней)/100;
				Иначе
					СтрокаТабЗаполнения.Пеня = 0;
				КонецЕсли;	
				
				Если СтрокаТабЗаполнения.Пеня < 0 Тогда
					СтрокаТабЗаполнения.Пеня = 0;
				КонецЕсли;
			
			КонецЦикла; 
			
		КонецЦикла; 
		
		МассивСтрокКУдалению = Новый Массив;
		Для каждого Строка  Из ТаблицаЗаполнения Цикл
		
			Если Строка.Пеня = 0 Тогда
				МассивСтрокКУдалению.Добавить(Строка);
			КонецЕсли;	
			
		КонецЦикла; 
		инд = 0;
		Пока инд <= МассивСтрокКУдалению.ВГраница() Цикл
			ТаблицаЗаполнения.Удалить(МассивСтрокКУдалению[Инд]);
			Инд = Инд+1;
		КонецЦикла;
		
		
		
		Объект.Таблица.Очистить();
		Объект.Таблица.Загрузить(ТаблицаЗаполнения);

КонецПроцедуры // ЗаполнитьНаСервере()

&НаСервереБезКонтекста
Функция ПолучитьСуммуНачисленойПени(ПериодС,ПериодПо,ЛС,МесяцНачисления)

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеПениПоЛС.МесяцНачисления,
		|	СУММА(НачислениеПениПоЛС.Сумма) КАК Сумма
		|ИЗ
		|	Документ.НачислениеПениПоЛС КАК НачислениеПениПоЛС
		|ГДЕ
		|	НачислениеПениПоЛС.МесяцНачисления = &МесяцНачисления
		|	И НачислениеПениПоЛС.ЛицевойСчет = &ЛицевойСчет
		|	И НачислениеПениПоЛС.ПериодС = &ПериодС
		|	И НачислениеПениПоЛС.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеПениПоЛС.МесяцНачисления";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	//Запрос.УстановитьПараметр("ПериодДо", ПериодПо);
	Запрос.УстановитьПараметр("ПериодС", ПериодС);
	Запрос.УстановитьПараметр("МесяцНачисления", НАчалоДня(КонецМесяца(МесяцНачисления)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.Сумма;
	Иначе
		Возврат 0;
	КонецЕсли;	


КонецФункции // ПолучитьСуммуНачисленойПени(НоваяСтрока.ПериодС,НоваяСтрока.ПериодПо);()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ПолучитьПлатежь(ЛицевойСчет,Дата,МесяцНачисления)
	

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеНаСчет.РасшифровкаПлатежа КАК ПоступлениеНаСчетРасшифровкаПлатежа
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	               |	И ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка.ЛицевойСчет = &ЛицевойСчет
	               |	И НАЧАЛОПЕРИОДА(ПоступлениеНаСчетРасшифровкаПлатежа.МесяцНачисления, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка";
	ЗАпрос.УстановитьПараметр("Дата",ДАТА);
	ЗАпрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	ЗАпрос.УстановитьПараметр("МесяцНачисления",МесяцНачисления);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
	

КонецФункции // ПолучитьПлатежь()


&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервре();
КонецПроцедуры

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура СоздатьДокументыНаСервре()
	
	//СторнироватьВсеДокументы();
	СтараяПеня = ПолучитьСтаруюПеню();
	
	ПропускатьЛС = Новый ТаблицаЗначений;
	ПропускатьЛС.Колонки.Добавить("ЛицевойСчет",Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета"));
	ПропускатьЛС.Колонки.Добавить("МесяцНачисления",Новый ОписаниеТипов("Дата"));
	ТаблицаПениШтрафов =  Объект.Таблица.Выгрузить();
	ТаблицаПениШтрафов.Свернуть("ЛицевойСчет,МесяцНАчисления","Пеня");
	
	Для каждого Строка Из ТаблицаПениШтрафов Цикл
		Если Строка.Пеня <= 0 Тогда
			Продолжить;
		КонецЕсли;	
	     СтруктураПоиска = Новый Структура;
		 СтруктураПоиска.Вставить("ЛицевойСчет",Строка.ЛицевойСчет);
		  СтруктураПоиска.Вставить("МесяцНачисления",Строка.МесяцНАчисления);
		 //СтруктураПоиска.Вставить("МесяцНачисления",Строка.МесяцНачисления);
		 НайденнаяСтараяПеня = СтараяПеня.НайтиСтроки(СтруктураПоиска);
		 Если НайденнаяСтараяПеня.Количество() <> 0 Тогда
			 
			 Если Строка.Пеня <= НайденнаяСтараяПеня[0].Сумма Тогда
				  НовСтрока  = ПропускатьЛС.Добавить();
				  НовСтрока.ЛицевойСчет = Строка.ЛицевойСчет;
				  НовСтрока.МесяцНАчисления = Строка.МесяцНАчисления;
			  ИначеЕсли Строка.Пеня = НайденнаяСтараяПеня[0].Сумма Тогда
				  НовСтрока  = ПропускатьЛС.Добавить();
				  НовСтрока.ЛицевойСчет = Строка.ЛицевойСчет;
				  НовСтрока.МесяцНАчисления = Строка.МесяцНАчисления;
			Иначе
	            СторнироватьВсеДокументы(Строка.ЛицевойСчет,Строка.МесяцНАчисления);
			 КонецЕсли;
		 КонецЕсли;
		 
	
	КонецЦикла; 
	
	Для Каждого Строка из Объект.Таблица Цикл
		Если Строка.СуммаЗадолженности <= 0 Тогда
			Продолжить;
		КонецЕсли;
		СТруктураПоискаЗапр = Новый Структура;
		СТруктураПоискаЗапр.Вставить("ЛицевойСчет",Строка.ЛицевойСчет);
		СТруктураПоискаЗапр.Вставить("МесяцНачисления",Строка.МесяцНачисления);
		НайденныйЗапрет = ПропускатьЛС.НайтиСтроки(СТруктураПоискаЗапр);
		Если НайденныйЗапрет.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;	
		Если Строка.СуммаЗадолженности <> 0 Тогда
			//СтараяПеня = ПолучитьСтаруюПеню(Строка.ЛицевойСчет,Строка.МесяцНачисления);
			//Если СтараяПеня >  Строка.Пеня Тогда
			//	Продолжить;
			//КонецЕсли;	
				
			НовыйДокумент = Документы.НачислениеПениПоЛС.СоздатьДокумент();
			НовыйДокумент.Дата = Объект.ДатаДокументов;
			НовыйДокумент.ПериодНачисления = НачалоМесяца(Объект.ДатаДокументов);
			НовыйДокумент.МесяцНачисления = Строка.МесяцНачисления;
			НовыйДокумент.Услуга = Объект.ПениШтрафы;
			НовыйДокумент.Организация = Объект.Организация;
			НовыйДокумент.Здание = Объект.Здание;
			НовыйДокумент.ЛицевойСчет = Строка.ЛицевойСчет;
			НовыйДокумент.Сумма = Строка.Пеня;
			НовыйДокумент.СумаДолга = Строка.СуммаЗадолженности;
			НовыйДокумент.ПериодС = Строка.ПериодС;
			НовыйДокумент.ПериодПо = Строка.ПериодПо;
			НовыйДокумент.Процент = Объект.ПроцентПени;
			НовыйДокумент.КоличествоДней = Строка.КолДней;
			Если Строка.пеня = 0 Тогда
				Продолжить;
			КонецЕсли;	
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;	
		КонецЕсли;
	
	
	КонецЦикла;
	
	

КонецПроцедуры // ЗоздатьДокументыНаСервре()

&НаСервере
Функция ПолучитьСтаруюПеню()
	
	ЗАпрос = Новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	               |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК Сумма,
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Регистратор.МесяцНачисления КАК МесяцНачисления
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(, , Регистратор, , ЛицевойСчет.Владелец = &Владелец) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга = &Услуга
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Регистратор.МесяцНачисления";
	
	ЗАпрос.УстановитьПараметр("Услуга",Справочники.Услуги.ПениШтрафы);
	ЗАпрос.УстановитьПараметр("Владелец",Объект.Здание);
	//ЗАпрос.УстановитьПараметр("МесяцНачисления",НачалоМесяца(МесяцНачисления));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;	
	
	Выборка = Результат.Выгрузить();
	
	
	
	Возврат Выборка;
	
	
	
КонецФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура СторнироватьВсеДокументы(ЛС,Месяц)
	
	//ТабОтбора = Объект.Таблица.Выгрузить(,"ЛицевойСчет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеПениПоЛС.Ссылка,
		|	НачислениеПениПоЛС.Сумма
		|ИЗ
		|	Документ.НачислениеПениПоЛС КАК НачислениеПениПоЛС
		|ГДЕ
		|	НачислениеПениПоЛС.Проведен = ИСТИНА
		|	И НачислениеПениПоЛС.Здание = &Здание
		|	И НачислениеПениПоЛС.ЛицевойСчет = &ЛицевыеСчета
		|	И НачислениеПениПоЛС.МесяцНачисления = &МесяцНачисления";
	
	Запрос.УстановитьПараметр("Здание",Объект.Здание);
	Запрос.УстановитьПараметр("ЛицевыеСчета",ЛС);
	Запрос.УстановитьПараметр("МесяцНачисления",Месяц);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовыйДокумент = ВыборкаДетальныеЗаписи.Ссылка.Скопировать();
		НовыйДокумент.Дата =Объект.ДатаДокументов;
		НовыйДокумент.ПериодНачисления =НачалоМесяца(Объект.ДатаДокументов);
		НовыйДокумент.Сумма = -НовыйДокумент.Сумма;
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецПроцедуры // СторнироватьВсеДокументы()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ПениШтрафы = Справочники.Услуги.ПениШтрафы;
КонецПроцедуры
